/*!
*file crc.h
*brief Файл объявлений функций расчета контрольных сумм
*/

#ifndef _CRC_H_
#define	_CRC_H_

/*-----------------------------------------------------------------------------
            Заголовки
-----------------------------------------------------------------------------*/
#include "../../board.h"

/*-----------------------------------------------------------------------------
            Определения
-----------------------------------------------------------------------------*/


/*-----------------------------------------------------------------------------
            Типы
-----------------------------------------------------------------------------*/


/*-----------------------------------------------------------------------------
            Глобальные переменные
-----------------------------------------------------------------------------*/
/*!
*@var extern uint16_t CodeCRC
*@brief Расчитанная контрольная сумма ПО
*/
extern uint16_t CodeCRC;
/*!
*@var extern uint16_t soft_crc_for_can
*@brief Контрольная сумма ПО, передаваемая по CAN
*/
extern uint16_t soft_crc_for_can;

/*-----------------------------------------------------------------------------
            Внешние переменные
-----------------------------------------------------------------------------*/


/*-----------------------------------------------------------------------------
            Глобальные функции
-----------------------------------------------------------------------------*/
/*!
*@fn uint16_t crc16(uint16_t icrc,uint8_t *icp,uint32_t icnt)
*@brief Функция расчета контрольной суммы блока памяти
*/
uint16_t crc16(uint16_t icrc,uint8_t *icp,uint32_t icnt);

//Возвращает однобайтную КС
uint8_t crc8(uint8_t icrc,uint8_t *icp,uint32_t icnt);

///*!
//*@fn uint16_t crc_data(uint8_t *data,uint16_t size)
//*@brief Функция расчета контрольной суммы блока данных
//*/
//uint16_t crc_data(uint8_t *data,uint16_t size);

/*!
*@fn uint16_t CheckProgram(void)
*Функция подсчета КС программы. После подсчета сравнивается с эталоном во флеш-памяти
*@return 0 - КС совпадает с эталоном, 1 - не совпадает
*/
uint16_t  CheckProgram(void);

#endif			/* End of _CRC_H_ */
