/*!
*@file idc_defs.h
*@brief Файл объявлений определений для обмена с ИДК
*/

#ifndef _IDC_DEFS_H_
#define	_IDC_DEFS_H_

/*-----------------------------------------------------------------------------
            Заголовки
-----------------------------------------------------------------------------*/
#include "../../board.h"

/*-----------------------------------------------------------------------------
            Типы
-----------------------------------------------------------------------------*/
/*!
*@enum IDC_COMMAND
*@brief Список команд, полученных от ИДК
*/
typedef enum
{
	SET_RAM_DATA = 0x53,							/* Запись СНП и настроек в ОЗУ */
	SET_ROM_DATA,									/* Запись СНП и настроек в ОЗУ и ЭЗУ */
	GET_RAM_DATA = 0x56,							/* Выдача СНП и настроек из ОЗУ */
	GET_ROM_DATA,									/* Выдача настроек из ЭЗУ */
	GET_DEV_NUMBER = 0x58,							/* Выдать номер устройства */
	
	/*Группы переменных мониторинга*/
	VAR_GROUP_1,									/* 1-я структура */
	VAR_GROUP_2 = 0x60,								/* 2-я структура, если есть */
	VAR_GROUP_3,								/* 3-я структура */
	GET_FALUTS,											/* Выдача отказов */
	
	/*Выбор модулей*/
	SELECT_MODULE_1 = 0x78,							/* Выбор 1-й структуры */
	SELECT_MODULE_2,								/* Выбор 2-й структуры */
}IDC_COMMANDS;

/*!
*@enum DEVICE_NUMBERS
*@brief Список номеров модулей
*/
typedef enum
{
	MODULE_ID_1 = 0x0,								/* 1-я структура */
	MODULE_ID_2,									/* 2-я структура, если есть */
	MODULE_ID_3,
}DEVICE_NUMBERS;

#pragma push
#pragma pack(1)
/*!
*@struct PSS_ptr_t
*@brief Текущая СНП и ее размер
*/
typedef struct _PSS_ptr_t
{
	uint8_t *data;
	uint16_t lenght;
}PSS_ptr_t;
#pragma pop

#pragma push
#pragma pack(1)
/*!
*@struct VersionDevice
*@brief Структура для описания идентификатора устройства
*/
typedef struct _VersionDevice
{
	uint8_t version[4];								/* Идентификатор для поиска устройства в sdf */
	uint16_t ser_num;								/* Номер блока (зав. номер) */
	uint32_t structID;								/* Идентификатор структуры, версия СНП */
	uint8_t nameID[4];								/* Идентификатор для отображения версии ПО БАРК в ИДК */
	uint8_t txt_number[10];							/* Зав. номер БАРК в текстовом формате */
} VersionDevice;
#pragma pop

/*
*@struct VirtualPackageHeader
*@brief Структура для хранения данных для дополнительных пакетов
*/
typedef struct _VirtualPackageHeader
{
	uint8_t header;									/*Заголовок*/
	uint8_t type;									/*Тип пакета */
	uint16_t lenght;								/*Длина пакета*/
	uint16_t CRC;									/*Контрольная сумма*/
	uint8_t* DataAddress;							/*Адрес, начиная с которого хранятся данные*/
} VirtualPackageHeader;

/*-----------------------------------------------------------------------------
            Определения
-----------------------------------------------------------------------------*/


/*-----------------------------------------------------------------------------
            Глобальные переменные
-----------------------------------------------------------------------------*/


/*-----------------------------------------------------------------------------
            Внешние переменные
-----------------------------------------------------------------------------*/


/*-----------------------------------------------------------------------------
            Глобальные функции
-----------------------------------------------------------------------------*/


#endif			/* End of _IDC_DEFS_H_ */
